<?xml version="1.0"?>
<net name="main_graph" version="11">
	<layers>
		<layer id="0" name="data" type="Input">
			<data shape="1,3,224,224" element_type="u8" execOrder="0" execTimeMcs="not_executed" originalLayersNames="data" outputLayouts="abcd" outputPrecisions="u8" primitiveType="unknown_I8" runtimePrecision="u8" />
			<output>
				<port id="0" precision="U8">
					<dim>1</dim>
					<dim>3</dim>
					<dim>224</dim>
					<dim>224</dim>
				</port>
			</output>
		</layer>
		<layer id="1" name="Gather_3036" type="Const">
			<data execOrder="1" execTimeMcs="not_executed" originalLayersNames="Gather_3036" outputLayouts="abcd" outputPrecisions="f32" primitiveType="unknown_f32" runtimePrecision="f32" />
			<output>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>3</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="2" name="Gather_3039" type="Const">
			<data execOrder="2" execTimeMcs="not_executed" originalLayersNames="Gather_3039" outputLayouts="abcd" outputPrecisions="f32" primitiveType="unknown_f32" runtimePrecision="f32" />
			<output>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>3</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="3" name="Divide_894" type="Subgraph">
			<data execOrder="3" execTimeMcs="72" originalLayersNames="Convert_806,Multiply_2969,Divide_894" outputLayouts="abcd" outputPrecisions="f32" primitiveType="jit_avx2_I8" runtimePrecision="u8" />
			<input>
				<port id="0" precision="U8">
					<dim>1</dim>
					<dim>3</dim>
					<dim>224</dim>
					<dim>224</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>1</dim>
					<dim>3</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
				<port id="2" precision="FP32">
					<dim>1</dim>
					<dim>3</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="3" precision="FP32">
					<dim>1</dim>
					<dim>3</dim>
					<dim>224</dim>
					<dim>224</dim>
				</port>
			</output>
		</layer>
		<layer id="4" name="Divide_894_abcd_acdb_/conv1/Conv/WithoutBiases" type="Reorder">
			<data execOrder="4" execTimeMcs="102" originalLayersNames="" outputLayouts="acdb" outputPrecisions="f32" primitiveType="jit_uni_f32" runtimePrecision="f32" />
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>3</dim>
					<dim>224</dim>
					<dim>224</dim>
				</port>
			</input>
			<output>
				<port id="1" precision="FP32">
					<dim>1</dim>
					<dim>3</dim>
					<dim>224</dim>
					<dim>224</dim>
				</port>
			</output>
		</layer>
		<layer id="5" name="Gather_3042_compressed" type="Const">
			<data execOrder="5" execTimeMcs="not_executed" originalLayersNames="Gather_3042_compressed" outputLayouts="abcd" outputPrecisions="f16" primitiveType="unknown_f16" runtimePrecision="f16" />
			<output>
				<port id="0" precision="FP16">
					<dim>64</dim>
					<dim>3</dim>
					<dim>7</dim>
					<dim>7</dim>
				</port>
			</output>
		</layer>
		<layer id="6" name="Reshape_121" type="Const">
			<data execOrder="6" execTimeMcs="not_executed" originalLayersNames="Reshape_121" outputLayouts="abcd" outputPrecisions="f32" primitiveType="unknown_f32" runtimePrecision="f32" />
			<output>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>64</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="7" name="Constant_7298" type="Const">
			<data execOrder="7" execTimeMcs="not_executed" originalLayersNames="Constant_7298" outputLayouts="a" outputPrecisions="i32" primitiveType="unknown_i32" runtimePrecision="i32" />
			<output>
				<port id="0" precision="I32">
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="8" name="Reshape_121_flatten_reshape" type="Reshape">
			<data execOrder="8" execTimeMcs="not_executed" originalLayersNames="Reshape_121_flatten_reshape" outputLayouts="a" outputPrecisions="f32" primitiveType="unknown_f32" runtimePrecision="f32" />
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>64</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
				<port id="1" precision="I32">
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32">
					<dim>64</dim>
				</port>
			</output>
		</layer>
		<layer id="9" name="/conv1/Conv/WithoutBiases" type="Convolution">
			<data execOrder="9" execTimeMcs="2651" originalLayersNames="/conv1/Conv/WithoutBiases,/conv1/Conv,/relu/Relu" outputLayouts="acdb" outputPrecisions="f32" primitiveType="brgconv_avx2_f32" runtimePrecision="f16" />
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>3</dim>
					<dim>224</dim>
					<dim>224</dim>
				</port>
				<port id="1" precision="FP16">
					<dim>64</dim>
					<dim>3</dim>
					<dim>7</dim>
					<dim>7</dim>
				</port>
				<port id="2" precision="FP32">
					<dim>64</dim>
				</port>
			</input>
			<output>
				<port id="3" precision="FP32">
					<dim>1</dim>
					<dim>64</dim>
					<dim>112</dim>
					<dim>112</dim>
				</port>
			</output>
		</layer>
		<layer id="10" name="/maxpool/MaxPool" type="Pooling">
			<data execOrder="10" execTimeMcs="323" originalLayersNames="/maxpool/MaxPool" outputLayouts="acdb" outputPrecisions="f32" primitiveType="jit_avx2_f32" runtimePrecision="f32" />
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>64</dim>
					<dim>112</dim>
					<dim>112</dim>
				</port>
			</input>
			<output>
				<port id="1" precision="FP32">
					<dim>1</dim>
					<dim>64</dim>
					<dim>56</dim>
					<dim>56</dim>
				</port>
			</output>
		</layer>
		<layer id="11" name="onnx::Conv_500_compressed" type="Const">
			<data execOrder="11" execTimeMcs="not_executed" originalLayersNames="onnx::Conv_500_compressed" outputLayouts="abcd" outputPrecisions="f16" primitiveType="unknown_f16" runtimePrecision="f16" />
			<output>
				<port id="0" precision="FP16">
					<dim>64</dim>
					<dim>64</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="12" name="Reshape_136" type="Const">
			<data execOrder="12" execTimeMcs="not_executed" originalLayersNames="Reshape_136" outputLayouts="abcd" outputPrecisions="f32" primitiveType="unknown_f32" runtimePrecision="f32" />
			<output>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>64</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="13" name="Constant_7700" type="Const">
			<data execOrder="13" execTimeMcs="not_executed" originalLayersNames="Constant_7700" outputLayouts="a" outputPrecisions="i32" primitiveType="unknown_i32" runtimePrecision="i32" />
			<output>
				<port id="0" precision="I32">
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="14" name="Reshape_136_flatten_reshape" type="Reshape">
			<data execOrder="14" execTimeMcs="not_executed" originalLayersNames="Reshape_136_flatten_reshape" outputLayouts="a" outputPrecisions="f32" primitiveType="unknown_f32" runtimePrecision="f32" />
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>64</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
				<port id="1" precision="I32">
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32">
					<dim>64</dim>
				</port>
			</output>
		</layer>
		<layer id="15" name="/layer1/layer1.0/conv1/Conv/WithoutBiases" type="Convolution">
			<data execOrder="15" execTimeMcs="380" originalLayersNames="/layer1/layer1.0/conv1/Conv/WithoutBiases,/layer1/layer1.0/conv1/Conv,/layer1/layer1.0/relu/Relu" outputLayouts="acdb" outputPrecisions="f32" primitiveType="brgconv_avx2_1x1_f32" runtimePrecision="f16" />
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>64</dim>
					<dim>56</dim>
					<dim>56</dim>
				</port>
				<port id="1" precision="FP16">
					<dim>64</dim>
					<dim>64</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
				<port id="2" precision="FP32">
					<dim>64</dim>
				</port>
			</input>
			<output>
				<port id="3" precision="FP32">
					<dim>1</dim>
					<dim>64</dim>
					<dim>56</dim>
					<dim>56</dim>
				</port>
			</output>
		</layer>
		<layer id="16" name="onnx::Conv_503_compressed" type="Const">
			<data execOrder="16" execTimeMcs="not_executed" originalLayersNames="onnx::Conv_503_compressed" outputLayouts="abcd" outputPrecisions="f16" primitiveType="unknown_f16" runtimePrecision="f16" />
			<output>
				<port id="0" precision="FP16">
					<dim>64</dim>
					<dim>64</dim>
					<dim>3</dim>
					<dim>3</dim>
				</port>
			</output>
		</layer>
		<layer id="17" name="Reshape_150" type="Const">
			<data execOrder="17" execTimeMcs="not_executed" originalLayersNames="Reshape_150" outputLayouts="abcd" outputPrecisions="f32" primitiveType="unknown_f32" runtimePrecision="f32" />
			<output>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>64</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="18" name="Constant_7715" type="Const">
			<data execOrder="18" execTimeMcs="not_executed" originalLayersNames="Constant_7715" outputLayouts="a" outputPrecisions="i32" primitiveType="unknown_i32" runtimePrecision="i32" />
			<output>
				<port id="0" precision="I32">
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="19" name="Reshape_150_flatten_reshape" type="Reshape">
			<data execOrder="19" execTimeMcs="not_executed" originalLayersNames="Reshape_150_flatten_reshape" outputLayouts="a" outputPrecisions="f32" primitiveType="unknown_f32" runtimePrecision="f32" />
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>64</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
				<port id="1" precision="I32">
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32">
					<dim>64</dim>
				</port>
			</output>
		</layer>
		<layer id="20" name="/layer1/layer1.0/conv2/Conv/WithoutBiases" type="Convolution">
			<data execOrder="20" execTimeMcs="2408" originalLayersNames="/layer1/layer1.0/conv2/Conv/WithoutBiases,/layer1/layer1.0/conv2/Conv,/layer1/layer1.0/relu_1/Relu" outputLayouts="acdb" outputPrecisions="f32" primitiveType="brgconv_avx2_f32" runtimePrecision="f16" />
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>64</dim>
					<dim>56</dim>
					<dim>56</dim>
				</port>
				<port id="1" precision="FP16">
					<dim>64</dim>
					<dim>64</dim>
					<dim>3</dim>
					<dim>3</dim>
				</port>
				<port id="2" precision="FP32">
					<dim>64</dim>
				</port>
			</input>
			<output>
				<port id="3" precision="FP32">
					<dim>1</dim>
					<dim>64</dim>
					<dim>56</dim>
					<dim>56</dim>
				</port>
			</output>
		</layer>
		<layer id="21" name="onnx::Conv_506_compressed" type="Const">
			<data execOrder="21" execTimeMcs="not_executed" originalLayersNames="onnx::Conv_506_compressed" outputLayouts="abcd" outputPrecisions="f16" primitiveType="unknown_f16" runtimePrecision="f16" />
			<output>
				<port id="0" precision="FP16">
					<dim>256</dim>
					<dim>64</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="22" name="Reshape_164" type="Const">
			<data execOrder="22" execTimeMcs="not_executed" originalLayersNames="Reshape_164" outputLayouts="abcd" outputPrecisions="f32" primitiveType="unknown_f32" runtimePrecision="f32" />
			<output>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>256</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="23" name="Constant_7733" type="Const">
			<data execOrder="23" execTimeMcs="not_executed" originalLayersNames="Constant_7733" outputLayouts="a" outputPrecisions="i32" primitiveType="unknown_i32" runtimePrecision="i32" />
			<output>
				<port id="0" precision="I32">
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="24" name="Reshape_164_flatten_reshape" type="Reshape">
			<data execOrder="24" execTimeMcs="not_executed" originalLayersNames="Reshape_164_flatten_reshape" outputLayouts="a" outputPrecisions="f32" primitiveType="unknown_f32" runtimePrecision="f32" />
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>256</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
				<port id="1" precision="I32">
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32">
					<dim>256</dim>
				</port>
			</output>
		</layer>
		<layer id="25" name="onnx::Conv_509_compressed" type="Const">
			<data execOrder="25" execTimeMcs="not_executed" originalLayersNames="onnx::Conv_509_compressed" outputLayouts="abcd" outputPrecisions="f16" primitiveType="unknown_f16" runtimePrecision="f16" />
			<output>
				<port id="0" precision="FP16">
					<dim>256</dim>
					<dim>64</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="26" name="Reshape_177" type="Const">
			<data execOrder="26" execTimeMcs="not_executed" originalLayersNames="Reshape_177" outputLayouts="abcd" outputPrecisions="f32" primitiveType="unknown_f32" runtimePrecision="f32" />
			<output>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>256</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="27" name="Constant_7742" type="Const">
			<data execOrder="27" execTimeMcs="not_executed" originalLayersNames="Constant_7742" outputLayouts="a" outputPrecisions="i32" primitiveType="unknown_i32" runtimePrecision="i32" />
			<output>
				<port id="0" precision="I32">
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="28" name="Reshape_177_flatten_reshape" type="Reshape">
			<data execOrder="28" execTimeMcs="not_executed" originalLayersNames="Reshape_177_flatten_reshape" outputLayouts="a" outputPrecisions="f32" primitiveType="unknown_f32" runtimePrecision="f32" />
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>256</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
				<port id="1" precision="I32">
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32">
					<dim>256</dim>
				</port>
			</output>
		</layer>
		<layer id="29" name="/layer1/layer1.0/downsample/downsample.0/Conv/WithoutBiases" type="Convolution">
			<data execOrder="29" execTimeMcs="1221" originalLayersNames="/layer1/layer1.0/downsample/downsample.0/Conv/WithoutBiases,/layer1/layer1.0/downsample/downsample.0/Conv" outputLayouts="acdb" outputPrecisions="f32" primitiveType="brgconv_avx2_1x1_f32" runtimePrecision="f16" />
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>64</dim>
					<dim>56</dim>
					<dim>56</dim>
				</port>
				<port id="1" precision="FP16">
					<dim>256</dim>
					<dim>64</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
				<port id="2" precision="FP32">
					<dim>256</dim>
				</port>
			</input>
			<output>
				<port id="3" precision="FP32">
					<dim>1</dim>
					<dim>256</dim>
					<dim>56</dim>
					<dim>56</dim>
				</port>
			</output>
		</layer>
		<layer id="30" name="/layer1/layer1.0/conv3/Conv/WithoutBiases" type="Convolution">
			<data execOrder="30" execTimeMcs="1319" originalLayersNames="/layer1/layer1.0/conv3/Conv/WithoutBiases,/layer1/layer1.0/conv3/Conv,/layer1/layer1.0/Add,/layer1/layer1.0/relu_2/Relu" outputLayouts="acdb" outputPrecisions="f32" primitiveType="brgconv_avx2_1x1_f32" runtimePrecision="f16" />
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>64</dim>
					<dim>56</dim>
					<dim>56</dim>
				</port>
				<port id="1" precision="FP16">
					<dim>256</dim>
					<dim>64</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
				<port id="2" precision="FP32">
					<dim>256</dim>
				</port>
				<port id="3" precision="FP32">
					<dim>1</dim>
					<dim>256</dim>
					<dim>56</dim>
					<dim>56</dim>
				</port>
			</input>
			<output>
				<port id="4" precision="FP32">
					<dim>1</dim>
					<dim>256</dim>
					<dim>56</dim>
					<dim>56</dim>
				</port>
			</output>
		</layer>
		<layer id="31" name="onnx::Conv_512_compressed" type="Const">
			<data execOrder="31" execTimeMcs="not_executed" originalLayersNames="onnx::Conv_512_compressed" outputLayouts="abcd" outputPrecisions="f16" primitiveType="unknown_f16" runtimePrecision="f16" />
			<output>
				<port id="0" precision="FP16">
					<dim>64</dim>
					<dim>256</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="32" name="Reshape_192" type="Const">
			<data execOrder="32" execTimeMcs="not_executed" originalLayersNames="Reshape_192" outputLayouts="abcd" outputPrecisions="f32" primitiveType="unknown_f32" runtimePrecision="f32" />
			<output>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>64</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="33" name="Constant_7751" type="Const">
			<data execOrder="33" execTimeMcs="not_executed" originalLayersNames="Constant_7751" outputLayouts="a" outputPrecisions="i32" primitiveType="unknown_i32" runtimePrecision="i32" />
			<output>
				<port id="0" precision="I32">
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="34" name="Reshape_192_flatten_reshape" type="Reshape">
			<data execOrder="34" execTimeMcs="not_executed" originalLayersNames="Reshape_192_flatten_reshape" outputLayouts="a" outputPrecisions="f32" primitiveType="unknown_f32" runtimePrecision="f32" />
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>64</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
				<port id="1" precision="I32">
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32">
					<dim>64</dim>
				</port>
			</output>
		</layer>
		<layer id="35" name="/layer1/layer1.1/conv1/Conv/WithoutBiases" type="Convolution">
			<data execOrder="35" execTimeMcs="1223" originalLayersNames="/layer1/layer1.1/conv1/Conv/WithoutBiases,/layer1/layer1.1/conv1/Conv,/layer1/layer1.1/relu/Relu" outputLayouts="acdb" outputPrecisions="f32" primitiveType="brgconv_avx2_1x1_f32" runtimePrecision="f16" />
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>256</dim>
					<dim>56</dim>
					<dim>56</dim>
				</port>
				<port id="1" precision="FP16">
					<dim>64</dim>
					<dim>256</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
				<port id="2" precision="FP32">
					<dim>64</dim>
				</port>
			</input>
			<output>
				<port id="3" precision="FP32">
					<dim>1</dim>
					<dim>64</dim>
					<dim>56</dim>
					<dim>56</dim>
				</port>
			</output>
		</layer>
		<layer id="36" name="onnx::Conv_515_compressed" type="Const">
			<data execOrder="36" execTimeMcs="not_executed" originalLayersNames="onnx::Conv_515_compressed" outputLayouts="abcd" outputPrecisions="f16" primitiveType="unknown_f16" runtimePrecision="f16" />
			<output>
				<port id="0" precision="FP16">
					<dim>64</dim>
					<dim>64</dim>
					<dim>3</dim>
					<dim>3</dim>
				</port>
			</output>
		</layer>
		<layer id="37" name="Reshape_206" type="Const">
			<data execOrder="37" execTimeMcs="not_executed" originalLayersNames="Reshape_206" outputLayouts="abcd" outputPrecisions="f32" primitiveType="unknown_f32" runtimePrecision="f32" />
			<output>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>64</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="38" name="Constant_7760" type="Const">
			<data execOrder="38" execTimeMcs="not_executed" originalLayersNames="Constant_7760" outputLayouts="a" outputPrecisions="i32" primitiveType="unknown_i32" runtimePrecision="i32" />
			<output>
				<port id="0" precision="I32">
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="39" name="Reshape_206_flatten_reshape" type="Reshape">
			<data execOrder="39" execTimeMcs="not_executed" originalLayersNames="Reshape_206_flatten_reshape" outputLayouts="a" outputPrecisions="f32" primitiveType="unknown_f32" runtimePrecision="f32" />
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>64</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
				<port id="1" precision="I32">
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32">
					<dim>64</dim>
				</port>
			</output>
		</layer>
		<layer id="40" name="/layer1/layer1.1/conv2/Conv/WithoutBiases" type="Convolution">
			<data execOrder="40" execTimeMcs="2381" originalLayersNames="/layer1/layer1.1/conv2/Conv/WithoutBiases,/layer1/layer1.1/conv2/Conv,/layer1/layer1.1/relu_1/Relu" outputLayouts="acdb" outputPrecisions="f32" primitiveType="brgconv_avx2_f32" runtimePrecision="f16" />
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>64</dim>
					<dim>56</dim>
					<dim>56</dim>
				</port>
				<port id="1" precision="FP16">
					<dim>64</dim>
					<dim>64</dim>
					<dim>3</dim>
					<dim>3</dim>
				</port>
				<port id="2" precision="FP32">
					<dim>64</dim>
				</port>
			</input>
			<output>
				<port id="3" precision="FP32">
					<dim>1</dim>
					<dim>64</dim>
					<dim>56</dim>
					<dim>56</dim>
				</port>
			</output>
		</layer>
		<layer id="41" name="onnx::Conv_518_compressed" type="Const">
			<data execOrder="41" execTimeMcs="not_executed" originalLayersNames="onnx::Conv_518_compressed" outputLayouts="abcd" outputPrecisions="f16" primitiveType="unknown_f16" runtimePrecision="f16" />
			<output>
				<port id="0" precision="FP16">
					<dim>256</dim>
					<dim>64</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="42" name="Reshape_220" type="Const">
			<data execOrder="42" execTimeMcs="not_executed" originalLayersNames="Reshape_220" outputLayouts="abcd" outputPrecisions="f32" primitiveType="unknown_f32" runtimePrecision="f32" />
			<output>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>256</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="43" name="Constant_7772" type="Const">
			<data execOrder="43" execTimeMcs="not_executed" originalLayersNames="Constant_7772" outputLayouts="a" outputPrecisions="i32" primitiveType="unknown_i32" runtimePrecision="i32" />
			<output>
				<port id="0" precision="I32">
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="44" name="Reshape_220_flatten_reshape" type="Reshape">
			<data execOrder="44" execTimeMcs="not_executed" originalLayersNames="Reshape_220_flatten_reshape" outputLayouts="a" outputPrecisions="f32" primitiveType="unknown_f32" runtimePrecision="f32" />
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>256</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
				<port id="1" precision="I32">
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32">
					<dim>256</dim>
				</port>
			</output>
		</layer>
		<layer id="45" name="/layer1/layer1.1/conv3/Conv/WithoutBiases" type="Convolution">
			<data execOrder="45" execTimeMcs="1283" originalLayersNames="/layer1/layer1.1/conv3/Conv/WithoutBiases,/layer1/layer1.1/conv3/Conv,/layer1/layer1.1/Add,/layer1/layer1.1/relu_2/Relu" outputLayouts="acdb" outputPrecisions="f32" primitiveType="brgconv_avx2_1x1_f32" runtimePrecision="f16" />
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>64</dim>
					<dim>56</dim>
					<dim>56</dim>
				</port>
				<port id="1" precision="FP16">
					<dim>256</dim>
					<dim>64</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
				<port id="2" precision="FP32">
					<dim>256</dim>
				</port>
				<port id="3" precision="FP32">
					<dim>1</dim>
					<dim>256</dim>
					<dim>56</dim>
					<dim>56</dim>
				</port>
			</input>
			<output>
				<port id="4" precision="FP32">
					<dim>1</dim>
					<dim>256</dim>
					<dim>56</dim>
					<dim>56</dim>
				</port>
			</output>
		</layer>
		<layer id="46" name="onnx::Conv_521_compressed" type="Const">
			<data execOrder="46" execTimeMcs="not_executed" originalLayersNames="onnx::Conv_521_compressed" outputLayouts="abcd" outputPrecisions="f16" primitiveType="unknown_f16" runtimePrecision="f16" />
			<output>
				<port id="0" precision="FP16">
					<dim>64</dim>
					<dim>256</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="47" name="Reshape_235" type="Const">
			<data execOrder="47" execTimeMcs="not_executed" originalLayersNames="Reshape_235" outputLayouts="abcd" outputPrecisions="f32" primitiveType="unknown_f32" runtimePrecision="f32" />
			<output>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>64</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="48" name="Constant_7781" type="Const">
			<data execOrder="48" execTimeMcs="not_executed" originalLayersNames="Constant_7781" outputLayouts="a" outputPrecisions="i32" primitiveType="unknown_i32" runtimePrecision="i32" />
			<output>
				<port id="0" precision="I32">
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="49" name="Reshape_235_flatten_reshape" type="Reshape">
			<data execOrder="49" execTimeMcs="not_executed" originalLayersNames="Reshape_235_flatten_reshape" outputLayouts="a" outputPrecisions="f32" primitiveType="unknown_f32" runtimePrecision="f32" />
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>64</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
				<port id="1" precision="I32">
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32">
					<dim>64</dim>
				</port>
			</output>
		</layer>
		<layer id="50" name="/layer1/layer1.2/conv1/Conv/WithoutBiases" type="Convolution">
			<data execOrder="50" execTimeMcs="1215" originalLayersNames="/layer1/layer1.2/conv1/Conv/WithoutBiases,/layer1/layer1.2/conv1/Conv,/layer1/layer1.2/relu/Relu" outputLayouts="acdb" outputPrecisions="f32" primitiveType="brgconv_avx2_1x1_f32" runtimePrecision="f16" />
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>256</dim>
					<dim>56</dim>
					<dim>56</dim>
				</port>
				<port id="1" precision="FP16">
					<dim>64</dim>
					<dim>256</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
				<port id="2" precision="FP32">
					<dim>64</dim>
				</port>
			</input>
			<output>
				<port id="3" precision="FP32">
					<dim>1</dim>
					<dim>64</dim>
					<dim>56</dim>
					<dim>56</dim>
				</port>
			</output>
		</layer>
		<layer id="51" name="onnx::Conv_524_compressed" type="Const">
			<data execOrder="51" execTimeMcs="not_executed" originalLayersNames="onnx::Conv_524_compressed" outputLayouts="abcd" outputPrecisions="f16" primitiveType="unknown_f16" runtimePrecision="f16" />
			<output>
				<port id="0" precision="FP16">
					<dim>64</dim>
					<dim>64</dim>
					<dim>3</dim>
					<dim>3</dim>
				</port>
			</output>
		</layer>
		<layer id="52" name="Reshape_249" type="Const">
			<data execOrder="52" execTimeMcs="not_executed" originalLayersNames="Reshape_249" outputLayouts="abcd" outputPrecisions="f32" primitiveType="unknown_f32" runtimePrecision="f32" />
			<output>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>64</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="53" name="Constant_7795" type="Const">
			<data execOrder="53" execTimeMcs="not_executed" originalLayersNames="Constant_7795" outputLayouts="a" outputPrecisions="i32" primitiveType="unknown_i32" runtimePrecision="i32" />
			<output>
				<port id="0" precision="I32">
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="54" name="Reshape_249_flatten_reshape" type="Reshape">
			<data execOrder="54" execTimeMcs="not_executed" originalLayersNames="Reshape_249_flatten_reshape" outputLayouts="a" outputPrecisions="f32" primitiveType="unknown_f32" runtimePrecision="f32" />
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>64</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
				<port id="1" precision="I32">
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32">
					<dim>64</dim>
				</port>
			</output>
		</layer>
		<layer id="55" name="/layer1/layer1.2/conv2/Conv/WithoutBiases" type="Convolution">
			<data execOrder="55" execTimeMcs="2386" originalLayersNames="/layer1/layer1.2/conv2/Conv/WithoutBiases,/layer1/layer1.2/conv2/Conv,/layer1/layer1.2/relu_1/Relu" outputLayouts="acdb" outputPrecisions="f32" primitiveType="brgconv_avx2_f32" runtimePrecision="f16" />
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>64</dim>
					<dim>56</dim>
					<dim>56</dim>
				</port>
				<port id="1" precision="FP16">
					<dim>64</dim>
					<dim>64</dim>
					<dim>3</dim>
					<dim>3</dim>
				</port>
				<port id="2" precision="FP32">
					<dim>64</dim>
				</port>
			</input>
			<output>
				<port id="3" precision="FP32">
					<dim>1</dim>
					<dim>64</dim>
					<dim>56</dim>
					<dim>56</dim>
				</port>
			</output>
		</layer>
		<layer id="56" name="onnx::Conv_527_compressed" type="Const">
			<data execOrder="56" execTimeMcs="not_executed" originalLayersNames="onnx::Conv_527_compressed" outputLayouts="abcd" outputPrecisions="f16" primitiveType="unknown_f16" runtimePrecision="f16" />
			<output>
				<port id="0" precision="FP16">
					<dim>256</dim>
					<dim>64</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="57" name="Reshape_263" type="Const">
			<data execOrder="57" execTimeMcs="not_executed" originalLayersNames="Reshape_263" outputLayouts="abcd" outputPrecisions="f32" primitiveType="unknown_f32" runtimePrecision="f32" />
			<output>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>256</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="58" name="Constant_7802" type="Const">
			<data execOrder="58" execTimeMcs="not_executed" originalLayersNames="Constant_7802" outputLayouts="a" outputPrecisions="i32" primitiveType="unknown_i32" runtimePrecision="i32" />
			<output>
				<port id="0" precision="I32">
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="59" name="Reshape_263_flatten_reshape" type="Reshape">
			<data execOrder="59" execTimeMcs="not_executed" originalLayersNames="Reshape_263_flatten_reshape" outputLayouts="a" outputPrecisions="f32" primitiveType="unknown_f32" runtimePrecision="f32" />
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>256</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
				<port id="1" precision="I32">
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32">
					<dim>256</dim>
				</port>
			</output>
		</layer>
		<layer id="60" name="/layer1/layer1.2/conv3/Conv/WithoutBiases" type="Convolution">
			<data execOrder="60" execTimeMcs="1355" originalLayersNames="/layer1/layer1.2/conv3/Conv/WithoutBiases,/layer1/layer1.2/conv3/Conv,/layer1/layer1.2/Add,/layer1/layer1.2/relu_2/Relu" outputLayouts="acdb" outputPrecisions="f32" primitiveType="brgconv_avx2_1x1_f32" runtimePrecision="f16" />
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>64</dim>
					<dim>56</dim>
					<dim>56</dim>
				</port>
				<port id="1" precision="FP16">
					<dim>256</dim>
					<dim>64</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
				<port id="2" precision="FP32">
					<dim>256</dim>
				</port>
				<port id="3" precision="FP32">
					<dim>1</dim>
					<dim>256</dim>
					<dim>56</dim>
					<dim>56</dim>
				</port>
			</input>
			<output>
				<port id="4" precision="FP32">
					<dim>1</dim>
					<dim>256</dim>
					<dim>56</dim>
					<dim>56</dim>
				</port>
			</output>
		</layer>
		<layer id="61" name="onnx::Conv_530_compressed" type="Const">
			<data execOrder="61" execTimeMcs="not_executed" originalLayersNames="onnx::Conv_530_compressed" outputLayouts="abcd" outputPrecisions="f16" primitiveType="unknown_f16" runtimePrecision="f16" />
			<output>
				<port id="0" precision="FP16">
					<dim>128</dim>
					<dim>256</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="62" name="Reshape_278" type="Const">
			<data execOrder="62" execTimeMcs="not_executed" originalLayersNames="Reshape_278" outputLayouts="abcd" outputPrecisions="f32" primitiveType="unknown_f32" runtimePrecision="f32" />
			<output>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>128</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="63" name="Constant_7809" type="Const">
			<data execOrder="63" execTimeMcs="not_executed" originalLayersNames="Constant_7809" outputLayouts="a" outputPrecisions="i32" primitiveType="unknown_i32" runtimePrecision="i32" />
			<output>
				<port id="0" precision="I32">
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="64" name="Reshape_278_flatten_reshape" type="Reshape">
			<data execOrder="64" execTimeMcs="not_executed" originalLayersNames="Reshape_278_flatten_reshape" outputLayouts="a" outputPrecisions="f32" primitiveType="unknown_f32" runtimePrecision="f32" />
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>128</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
				<port id="1" precision="I32">
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32">
					<dim>128</dim>
				</port>
			</output>
		</layer>
		<layer id="65" name="/layer2/layer2.0/conv1/Conv/WithoutBiases" type="Convolution">
			<data execOrder="65" execTimeMcs="2224" originalLayersNames="/layer2/layer2.0/conv1/Conv/WithoutBiases,/layer2/layer2.0/conv1/Conv,/layer2/layer2.0/relu/Relu" outputLayouts="acdb" outputPrecisions="f32" primitiveType="brgconv_avx2_1x1_f32" runtimePrecision="f16" />
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>256</dim>
					<dim>56</dim>
					<dim>56</dim>
				</port>
				<port id="1" precision="FP16">
					<dim>128</dim>
					<dim>256</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
				<port id="2" precision="FP32">
					<dim>128</dim>
				</port>
			</input>
			<output>
				<port id="3" precision="FP32">
					<dim>1</dim>
					<dim>128</dim>
					<dim>56</dim>
					<dim>56</dim>
				</port>
			</output>
		</layer>
		<layer id="66" name="onnx::Conv_533_compressed" type="Const">
			<data execOrder="66" execTimeMcs="not_executed" originalLayersNames="onnx::Conv_533_compressed" outputLayouts="abcd" outputPrecisions="f16" primitiveType="unknown_f16" runtimePrecision="f16" />
			<output>
				<port id="0" precision="FP16">
					<dim>128</dim>
					<dim>128</dim>
					<dim>3</dim>
					<dim>3</dim>
				</port>
			</output>
		</layer>
		<layer id="67" name="Reshape_292" type="Const">
			<data execOrder="67" execTimeMcs="not_executed" originalLayersNames="Reshape_292" outputLayouts="abcd" outputPrecisions="f32" primitiveType="unknown_f32" runtimePrecision="f32" />
			<output>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>128</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="68" name="Constant_7819" type="Const">
			<data execOrder="68" execTimeMcs="not_executed" originalLayersNames="Constant_7819" outputLayouts="a" outputPrecisions="i32" primitiveType="unknown_i32" runtimePrecision="i32" />
			<output>
				<port id="0" precision="I32">
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="69" name="Reshape_292_flatten_reshape" type="Reshape">
			<data execOrder="69" execTimeMcs="not_executed" originalLayersNames="Reshape_292_flatten_reshape" outputLayouts="a" outputPrecisions="f32" primitiveType="unknown_f32" runtimePrecision="f32" />
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>128</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
				<port id="1" precision="I32">
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32">
					<dim>128</dim>
				</port>
			</output>
		</layer>
		<layer id="70" name="/layer2/layer2.0/conv2/Conv/WithoutBiases" type="Convolution">
			<data execOrder="70" execTimeMcs="2407" originalLayersNames="/layer2/layer2.0/conv2/Conv/WithoutBiases,/layer2/layer2.0/conv2/Conv,/layer2/layer2.0/relu_1/Relu" outputLayouts="acdb" outputPrecisions="f32" primitiveType="brgconv_avx2_f32" runtimePrecision="f16" />
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>128</dim>
					<dim>56</dim>
					<dim>56</dim>
				</port>
				<port id="1" precision="FP16">
					<dim>128</dim>
					<dim>128</dim>
					<dim>3</dim>
					<dim>3</dim>
				</port>
				<port id="2" precision="FP32">
					<dim>128</dim>
				</port>
			</input>
			<output>
				<port id="3" precision="FP32">
					<dim>1</dim>
					<dim>128</dim>
					<dim>28</dim>
					<dim>28</dim>
				</port>
			</output>
		</layer>
		<layer id="71" name="onnx::Conv_536_compressed" type="Const">
			<data execOrder="71" execTimeMcs="not_executed" originalLayersNames="onnx::Conv_536_compressed" outputLayouts="abcd" outputPrecisions="f16" primitiveType="unknown_f16" runtimePrecision="f16" />
			<output>
				<port id="0" precision="FP16">
					<dim>512</dim>
					<dim>128</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="72" name="Reshape_306" type="Const">
			<data execOrder="72" execTimeMcs="not_executed" originalLayersNames="Reshape_306" outputLayouts="abcd" outputPrecisions="f32" primitiveType="unknown_f32" runtimePrecision="f32" />
			<output>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>512</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="73" name="Constant_7826" type="Const">
			<data execOrder="73" execTimeMcs="not_executed" originalLayersNames="Constant_7826" outputLayouts="a" outputPrecisions="i32" primitiveType="unknown_i32" runtimePrecision="i32" />
			<output>
				<port id="0" precision="I32">
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="74" name="Reshape_306_flatten_reshape" type="Reshape">
			<data execOrder="74" execTimeMcs="not_executed" originalLayersNames="Reshape_306_flatten_reshape" outputLayouts="a" outputPrecisions="f32" primitiveType="unknown_f32" runtimePrecision="f32" />
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>512</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
				<port id="1" precision="I32">
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32">
					<dim>512</dim>
				</port>
			</output>
		</layer>
		<layer id="75" name="onnx::Conv_539_compressed" type="Const">
			<data execOrder="75" execTimeMcs="not_executed" originalLayersNames="onnx::Conv_539_compressed" outputLayouts="abcd" outputPrecisions="f16" primitiveType="unknown_f16" runtimePrecision="f16" />
			<output>
				<port id="0" precision="FP16">
					<dim>512</dim>
					<dim>256</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="76" name="Reshape_319" type="Const">
			<data execOrder="76" execTimeMcs="not_executed" originalLayersNames="Reshape_319" outputLayouts="abcd" outputPrecisions="f32" primitiveType="unknown_f32" runtimePrecision="f32" />
			<output>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>512</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="77" name="Constant_7835" type="Const">
			<data execOrder="77" execTimeMcs="not_executed" originalLayersNames="Constant_7835" outputLayouts="a" outputPrecisions="i32" primitiveType="unknown_i32" runtimePrecision="i32" />
			<output>
				<port id="0" precision="I32">
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="78" name="Reshape_319_flatten_reshape" type="Reshape">
			<data execOrder="78" execTimeMcs="not_executed" originalLayersNames="Reshape_319_flatten_reshape" outputLayouts="a" outputPrecisions="f32" primitiveType="unknown_f32" runtimePrecision="f32" />
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>512</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
				<port id="1" precision="I32">
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32">
					<dim>512</dim>
				</port>
			</output>
		</layer>
		<layer id="79" name="/layer2/layer2.0/downsample/downsample.0/Conv/WithoutBiases" type="Convolution">
			<data execOrder="79" execTimeMcs="2246" originalLayersNames="/layer2/layer2.0/downsample/downsample.0/Conv/WithoutBiases,/layer2/layer2.0/downsample/downsample.0/Conv" outputLayouts="acdb" outputPrecisions="f32" primitiveType="brgconv_avx2_1x1_f32" runtimePrecision="f16" />
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>256</dim>
					<dim>56</dim>
					<dim>56</dim>
				</port>
				<port id="1" precision="FP16">
					<dim>512</dim>
					<dim>256</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
				<port id="2" precision="FP32">
					<dim>512</dim>
				</port>
			</input>
			<output>
				<port id="3" precision="FP32">
					<dim>1</dim>
					<dim>512</dim>
					<dim>28</dim>
					<dim>28</dim>
				</port>
			</output>
		</layer>
		<layer id="80" name="/layer2/layer2.0/conv3/Conv/WithoutBiases" type="Convolution">
			<data execOrder="80" execTimeMcs="1220" originalLayersNames="/layer2/layer2.0/conv3/Conv/WithoutBiases,/layer2/layer2.0/conv3/Conv,/layer2/layer2.0/Add,/layer2/layer2.0/relu_2/Relu" outputLayouts="acdb" outputPrecisions="f32" primitiveType="brgconv_avx2_1x1_f32" runtimePrecision="f16" />
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>128</dim>
					<dim>28</dim>
					<dim>28</dim>
				</port>
				<port id="1" precision="FP16">
					<dim>512</dim>
					<dim>128</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
				<port id="2" precision="FP32">
					<dim>512</dim>
				</port>
				<port id="3" precision="FP32">
					<dim>1</dim>
					<dim>512</dim>
					<dim>28</dim>
					<dim>28</dim>
				</port>
			</input>
			<output>
				<port id="4" precision="FP32">
					<dim>1</dim>
					<dim>512</dim>
					<dim>28</dim>
					<dim>28</dim>
				</port>
			</output>
		</layer>
		<layer id="81" name="onnx::Conv_542_compressed" type="Const">
			<data execOrder="81" execTimeMcs="not_executed" originalLayersNames="onnx::Conv_542_compressed" outputLayouts="abcd" outputPrecisions="f16" primitiveType="unknown_f16" runtimePrecision="f16" />
			<output>
				<port id="0" precision="FP16">
					<dim>128</dim>
					<dim>512</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="82" name="Reshape_334" type="Const">
			<data execOrder="82" execTimeMcs="not_executed" originalLayersNames="Reshape_334" outputLayouts="abcd" outputPrecisions="f32" primitiveType="unknown_f32" runtimePrecision="f32" />
			<output>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>128</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="83" name="Constant_7850" type="Const">
			<data execOrder="83" execTimeMcs="not_executed" originalLayersNames="Constant_7850" outputLayouts="a" outputPrecisions="i32" primitiveType="unknown_i32" runtimePrecision="i32" />
			<output>
				<port id="0" precision="I32">
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="84" name="Reshape_334_flatten_reshape" type="Reshape">
			<data execOrder="84" execTimeMcs="not_executed" originalLayersNames="Reshape_334_flatten_reshape" outputLayouts="a" outputPrecisions="f32" primitiveType="unknown_f32" runtimePrecision="f32" />
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>128</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
				<port id="1" precision="I32">
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32">
					<dim>128</dim>
				</port>
			</output>
		</layer>
		<layer id="85" name="/layer2/layer2.1/conv1/Conv/WithoutBiases" type="Convolution">
			<data execOrder="85" execTimeMcs="1210" originalLayersNames="/layer2/layer2.1/conv1/Conv/WithoutBiases,/layer2/layer2.1/conv1/Conv,/layer2/layer2.1/relu/Relu" outputLayouts="acdb" outputPrecisions="f32" primitiveType="brgconv_avx2_1x1_f32" runtimePrecision="f16" />
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>512</dim>
					<dim>28</dim>
					<dim>28</dim>
				</port>
				<port id="1" precision="FP16">
					<dim>128</dim>
					<dim>512</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
				<port id="2" precision="FP32">
					<dim>128</dim>
				</port>
			</input>
			<output>
				<port id="3" precision="FP32">
					<dim>1</dim>
					<dim>128</dim>
					<dim>28</dim>
					<dim>28</dim>
				</port>
			</output>
		</layer>
		<layer id="86" name="onnx::Conv_545_compressed" type="Const">
			<data execOrder="86" execTimeMcs="not_executed" originalLayersNames="onnx::Conv_545_compressed" outputLayouts="abcd" outputPrecisions="f16" primitiveType="unknown_f16" runtimePrecision="f16" />
			<output>
				<port id="0" precision="FP16">
					<dim>128</dim>
					<dim>128</dim>
					<dim>3</dim>
					<dim>3</dim>
				</port>
			</output>
		</layer>
		<layer id="87" name="Reshape_348" type="Const">
			<data execOrder="87" execTimeMcs="not_executed" originalLayersNames="Reshape_348" outputLayouts="abcd" outputPrecisions="f32" primitiveType="unknown_f32" runtimePrecision="f32" />
			<output>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>128</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="88" name="Constant_7861" type="Const">
			<data execOrder="88" execTimeMcs="not_executed" originalLayersNames="Constant_7861" outputLayouts="a" outputPrecisions="i32" primitiveType="unknown_i32" runtimePrecision="i32" />
			<output>
				<port id="0" precision="I32">
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="89" name="Reshape_348_flatten_reshape" type="Reshape">
			<data execOrder="89" execTimeMcs="not_executed" originalLayersNames="Reshape_348_flatten_reshape" outputLayouts="a" outputPrecisions="f32" primitiveType="unknown_f32" runtimePrecision="f32" />
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>128</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
				<port id="1" precision="I32">
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32">
					<dim>128</dim>
				</port>
			</output>
		</layer>
		<layer id="90" name="/layer2/layer2.1/conv2/Conv/WithoutBiases" type="Convolution">
			<data execOrder="90" execTimeMcs="2365" originalLayersNames="/layer2/layer2.1/conv2/Conv/WithoutBiases,/layer2/layer2.1/conv2/Conv,/layer2/layer2.1/relu_1/Relu" outputLayouts="acdb" outputPrecisions="f32" primitiveType="brgconv_avx2_f32" runtimePrecision="f16" />
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>128</dim>
					<dim>28</dim>
					<dim>28</dim>
				</port>
				<port id="1" precision="FP16">
					<dim>128</dim>
					<dim>128</dim>
					<dim>3</dim>
					<dim>3</dim>
				</port>
				<port id="2" precision="FP32">
					<dim>128</dim>
				</port>
			</input>
			<output>
				<port id="3" precision="FP32">
					<dim>1</dim>
					<dim>128</dim>
					<dim>28</dim>
					<dim>28</dim>
				</port>
			</output>
		</layer>
		<layer id="91" name="onnx::Conv_548_compressed" type="Const">
			<data execOrder="91" execTimeMcs="not_executed" originalLayersNames="onnx::Conv_548_compressed" outputLayouts="abcd" outputPrecisions="f16" primitiveType="unknown_f16" runtimePrecision="f16" />
			<output>
				<port id="0" precision="FP16">
					<dim>512</dim>
					<dim>128</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="92" name="Reshape_362" type="Const">
			<data execOrder="92" execTimeMcs="not_executed" originalLayersNames="Reshape_362" outputLayouts="abcd" outputPrecisions="f32" primitiveType="unknown_f32" runtimePrecision="f32" />
			<output>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>512</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="93" name="Constant_7876" type="Const">
			<data execOrder="93" execTimeMcs="not_executed" originalLayersNames="Constant_7876" outputLayouts="a" outputPrecisions="i32" primitiveType="unknown_i32" runtimePrecision="i32" />
			<output>
				<port id="0" precision="I32">
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="94" name="Reshape_362_flatten_reshape" type="Reshape">
			<data execOrder="94" execTimeMcs="not_executed" originalLayersNames="Reshape_362_flatten_reshape" outputLayouts="a" outputPrecisions="f32" primitiveType="unknown_f32" runtimePrecision="f32" />
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>512</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
				<port id="1" precision="I32">
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32">
					<dim>512</dim>
				</port>
			</output>
		</layer>
		<layer id="95" name="/layer2/layer2.1/conv3/Conv/WithoutBiases" type="Convolution">
			<data execOrder="95" execTimeMcs="1238" originalLayersNames="/layer2/layer2.1/conv3/Conv/WithoutBiases,/layer2/layer2.1/conv3/Conv,/layer2/layer2.1/Add,/layer2/layer2.1/relu_2/Relu" outputLayouts="acdb" outputPrecisions="f32" primitiveType="brgconv_avx2_1x1_f32" runtimePrecision="f16" />
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>128</dim>
					<dim>28</dim>
					<dim>28</dim>
				</port>
				<port id="1" precision="FP16">
					<dim>512</dim>
					<dim>128</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
				<port id="2" precision="FP32">
					<dim>512</dim>
				</port>
				<port id="3" precision="FP32">
					<dim>1</dim>
					<dim>512</dim>
					<dim>28</dim>
					<dim>28</dim>
				</port>
			</input>
			<output>
				<port id="4" precision="FP32">
					<dim>1</dim>
					<dim>512</dim>
					<dim>28</dim>
					<dim>28</dim>
				</port>
			</output>
		</layer>
